Repository: mapokapo/riskfactor
Catalog: lib/l10n/app_*.arb
Languages: bs

# vitaminDShortDesc
source: Vitamin D can be found in cod liver oil and other fatty fish. Furthermore, foods rich in vitamin D include some mushrooms, yeast, beef liver and egg yolk. Vitamin D helps regulate the amount of calcium and phosphate in the body.
bs: Vitamin D se može naći u ulju jetre bakalara i drugoj masnoj ribi. Nadalje, hrana bogata vitaminom D uključuje neke gljive, kvasac, goveđu jetru i žumanjak. Vitamin D pomaže u regulaciji količine kalcija i fosfata u tijelu.

# vitaminDContent
source: Vitamin D is important for healthy bones, teeth and muscles. A lack of it can lead to a bone deformity illness called rickets in children, and a similar bone weakness condition called osteomalacia in adults. There are also suggestions that vitamin D boosts the immune system and helps fight off infections. Some studies suggest adequate vitamin D levels help when we have common colds and flu, for example. But evidence from research is inconsistent. The Scientific Advisory Committee on Nutrition (SACN) says studies on using vitamin D for treating or preventing chest infections showed insufficient evidence to recommend it for this.
bs: Vitamin D važan je za zdrave kosti, zube i mišiće. Njegov nedostatak može kod djece dovesti do bolesti deformacije kosti koja se naziva rahitis, a kod odraslih sličnog stanja slabosti kostiju nazvane osteomalacija. Postoje i prijedlozi da vitamin D pojačava imunološki sustav i pomaže u borbi protiv infekcija. Neke studije sugeriraju da odgovarajuća razina vitamina D pomaže kada imamo, primjerice, prehladu i gripu. No, dokazi iz istraživanja su nedosljedni. Znanstveni savjetodavni odbor za prehranu (SACN) kaže da studije o upotrebi vitamina D za liječenje ili prevenciju infekcija prsnog koša nisu pokazale dovoljno dokaza da ga preporuče za to.

# nutritionValues
source: Nutrition values for vitamins
bs: Gdje možete pronaći vitamine u hrani
