Repository: mapokapo/riskfactor
Catalog: lib/l10n/app_*.arb
Languages: bs

source: Worldwide COVID-19 cases
bs: Slučajevi COVID-19 širom svijeta

source: Loading
bs: Učitavanje

source: Sign In
bs: Prijavi se

source: Register
bs: Registriraj se

source: Password
bs: Lozinka

# signInFormTitle
source: Please input your email address and password below
bs: Molimo upišite email adresu i lozinku ispod

# registerFormStep1Title
source: Welcome to RiskFactor! Please input your full name below
bs: Dobrodošli u Riskfactor! Molimo unesite puno ime ispod

source: First Name
bs: Ime

source: Last Name
bs: Prezime

# registerFormStep2Title
source: Please choose an email address and password
bs: Molimo vas da izaberete email adresu i lozinku

# registerFormStep3Title
source: We need some basic information about you
bs: Potrebne su nam neke osnovne informacije o vama

source: Height
bs: Visina

source: Weight
bs: Težina

source: Age
bs: Dob

source: Gender
bs: Spol

source: Male
bs: Muško

source: Female
bs: Žensko

# registerFormStep4Title
source: Finished! You can now proceed to Riskfactor
bs: Završeno! Sada možete ući u Riskfactor

source: Finish
bs: Završi

# validationRequiredField
source: This field is required
bs: Morate unijeti ovo polje

# validationInvalidEmail
source: Not a valid email address
bs: Ne važeća email adresa

# validationPasswordMin8Characters
source: Password must be at least 8 characters
bs: Lozinka mora imati najmanje 8 slova

# validationPasswordCapitalLetter
source: Password must have a capital letter
bs: Lozinka mora imati veliko slovo

# validationPasswordLetter
source: Password must have a letter
bs: Lozinka mora imati slovo

# validationPasswordNumber
source: Password must have a number
bs: Lozinka mora imati broj

# validationNameMin2Characters
source: Name must be at least 2 characters
bs: Ime mora biti najmanje 2 slova

# validationNameMax256Characters
source: Name must be at most 256 characters
bs: Ime mora imate najviše 256 slova

# validationNameSymbols
source: Name mustn't contain symbols
bs: Ime ne smije sadržavati simbole

# validationNotANumber
source: You must input a number
bs: Morate unijeti broj

# validationNotAnInteger
source: You must input an integer
bs: Morate unijeti cijeli broj

source: Next
bs: Dalje

source: Welcome
bs: Dobrodošli

source: Health status
bs: Stanje zdravlja

source: Unavailable
bs: Nedostupno

# infectionRisk
source: Risk of infection
bs: Mogućnost zaraze

# fetchErrorReopenApp
source: Error fetching data. Please reopen the app to continue.
bs: Problem u učitavanju podataka. Molimo ponovno pokrenite aplikaciju.

# signOutConfirmation
source: Are you sure you want to sign out?
bs: Jeste li sigurni da se želite odjaviti?

source: Yes
bs: Da

source: No
bs: Ne

# covid19TestNotCompleted
source: You haven't completed the COVID-19 self-assesment test.
bs: Niste dovršili COVID-19 test.

source: Click here to start
bs: Pritisnite ovdje da započnete

# allFieldsRequired
source: You must answer every question to get your results
bs: Morate odgovoriti na svako pitanje da biste dobili rezultate

# covid19TestQuestion1Title
source: Have you had close contact to a confirmed patient of COVID-19?
bs: Jeste li imali bliski kontakt sa osobom zaraženom sa COVID-19?

# covid19TestQuestion2Title
source: If you were, when?
bs: Ako Jeste, kada?

# covid19TestQuestion3Title
source: Have you had any symptoms of COVID-19?
bs: Jeste li imali ikakve simptome COVID-19?

# covid19TestQuestion4Title
source: If so, when did the symptoms start?
bs: Ako jeste, kada su vam počeli simptomi?

# covid19TestQuestion5Title
source: Do you have any of the following symptoms?
bs: Imate li ijedan od sljedećih simptoma:

# chooseDate
source: Choose a date
bs: Odaberite datum

# had_fever_in_past_24h
source: Had fever in the last 24 hours
bs: Temperatura 38°C u zadnja 24 sata

# had_fever_in_past_4d
source: Had fever in the last 4 days
bs: Temperatura 38°C u zadnja 4 dana

# chills
source: Had chills
bs: Zimica/vrućica

# lost_taste
source: Lost the sensation of taste
bs: Gubitak osjetila okusa

# body_aches
source: Had body aches
bs: Tjelesni bolovi

# retakeOrView
source: Do you want to retake the test or view your previous results?
bs: Želite li viditi rezultate prošlog testa ili ponoviti test?

# retake
source: Retake test
bs: Ponovi test

# view
source: View previous results
bs: Vidi prošle rezultate

# ourRecommendations
source: Our recommendations on what to do next:
bs: Naše preporuke za sljedeće korake:

# shouldGetTested
source: You should get tested.
bs: Trebali biste se testirati.

# shouldTakePrecautions
source: You should take precautions.
bs: Trebali biste se pridržavati mjera predostrožnosti.

# notAtRisk
source: You are not at risk.
bs: Niste u rizičnoj situaciji.

# case1RecommendationText
source: Please call your general practitioner or the medical on-call service. If you have a shortness of breath that becomes severe, please seek medical help. Please check in daily with a trusted person about your current condition and any potential worsening of symptoms.
bs: Nazovite svog liječnika opće prakse ili dežurnu medicinsku službu. Ako imate otežano disanje koje postaje ozbiljno, potražite liječničku pomoć. Prijavite se svakodnevno kod pouzdane osobe o vašem trenutnom stanju i potencijalnom pogoršanju simptoma.

# case2RecommendationText
source: When you leave the house, keep enough distance (at least 1.5 meters) from other people and follow the rules of conduct for protection against infection. Please avoid unnecessary contact with other people and stay at home if possible.
bs: Kada napuštate kuću, pridržavajte se socijalne distance (najmanje 1,5 metra) od drugih ljudi i slijedite pravila ponašanja za zaštitu od infekcija. Molimo vas izbjegavajte nepotrebni kontakt s drugim ljudima i ako je moguće ostanite kod kuće.

# case3RecommendationText
source: Stay healthy and help stop the spread of COVID-19. When possible, please stay in your own room as the virus is easily transmitted. In the event of contact you and your relatives should keep a distance of at least 1.5 meters and wear mouth and nose protection. Do not use the kitchen, hallway, bathroom and other common areas more often than absolutely necessary and take your meals separate from one another in terms of time and space. If possible, people with risk factors should not be in the same household with you. These are: People with suppressed immune systems, people with chronic basic diseases, the elderly
bs: Ostanite zdravi i pomozite zaustaviti širenje COVID-19. Kada je moguće, ostanite u svojoj sobi jer se virus lako prenosi. U slučaju zaraze vi i vaša rodbinu trebate držati udaljenost od najmanje 1,5 metara i nositi zaštitnu masku za usta i nos. Nemojte koristiti kuhinju, hodnik, kupaonicu i ostale zajedničke prostore češće nego što je apsolutno potrebno i obroke odvajajte jedni od drugih u smislu vremena i prostora. Ako je moguće, osobe s čimbenicima rizika ne bi trebale biti u istom domaćinstvu s vama. To su: osobe s potisnutim imunološkim sustavom, osobe s kroničnim osnovnim bolestima, te starije osobe.

# generalRecommendationText1
source: Please discuss how to proceed with your general practitioner and try to maintain a safe physical distance from your relative(s) in care.
bs: Molimo razgovarajte o tome kako postupati sa svojim liječnikom opće prakse i pokušajte održavati sigurnu fizičku udaljenost od svoje rodbine u skrbi.

# generalRecommendationText2
source: If you work in a medical environment, please inform your employer of your contact or current symptoms and discuss further measures to protect the people around you and your colleagues.
bs: Ako radite u medicinskom okruženju, obavijestite poslodavca o kontaktima ili trenutnim simptomima i razgovarajte o daljnjim mjerama za zaštitu ljudi oko vas i vaših kolega.

# callHospital
source: Contact your hospital
bs: Kontaktirajte bolnicu

# viewMoreInfo
source: More info
bs: Više informacija

# darkMode
source: Toggle dark mode
bs: Tamni način

source: Settings
bs: Postavke

source: Sign Out
bs: Odjavi se

# about
source: About the app
bs: O aplikaciji

# appLegalese
source: Here you can view the licenses of the libraries this app uses. You can read our privacy policy down below.
bs: Ovdje možete pregledati licence biblioteka koje ova aplikacija koristi. Dolje možete pročitati naše uvjete privatnosti.

# viewPrivacyPolicy
source: View our privacy policy
bs: Pogledajte naše uvjete privatnosti

# homePageText
source: When you finish the COVID-19 test below, you will get your results and recommended actions.
bs: Kada završite COVID-19 test, dobit ćete svoje rezultate i preporučene radnje.

source: Choose language
bs: Odaberite jezik

# case1Name
source: High Risk
bs: Visok Rizik

# case2Name
source: Medium Risk A
bs: Umjeren Rizik A

# case3Name
source: Medium Risk B
bs: Umjeren Rizik B

# case4Name
source: Low Risk
bs: Nizak Rizik

# case5Name
source: No Risk
bs: Bez Rizika

# case1Info
source: Either had contact and within 14 days after contact at least one symptom occurred or symptoms started before contact
bs: Osoba imala kontakt te u roku od 14 dana nakon kontakta dogodio se barem jedan simptom pojavio, ili su simptomi započeli prije kontakta

# case2Info
source: Combination of general and respiratory symptoms started either a) after 14 days after contact or b) there was no contact at all
bs: Kombinacija općih i respiratornih simptoma koji su započeli 14 dana nakon kontakta ili ako uopće nije bilo kontakta

# case3Info
source: Had contact during last 14 days but no symptoms
bs: Osoba imala kontakt tijekom zadnjih 14 dana, ali bez simptoma

# case4Info
source: Either a) had symptoms that started 14 days after contact and which are not a combination of general and respiratory symptoms or b) didn't had contact but symptoms which are not a combination of general and respiratory symptoms
bs: Osoba je ili imala simptome koji su započeli 14 dana nakon kontakta i koji nisu kombinacija općih i respiratornih simptoma ili nije imao kontakt, ali simptome koji nisu kombinacija općih i respiratornih simptoma

# case5Info
source: No contacts, no symptoms
bs: Bez kontakta i bez simptoma

# covid19TestResults
source: Test Results
bs: Rezultati testa

# caseMeanings
source: Test result cases have the following meanings:
bs: Rezultati testa imaju sljedeća značenja:

source: Nutrition
bs: Prehrana

# vitaminAShortDesc
source: Adequate intake of vitamin A through food will prevent hair loss, various skin diseases, dry eyes, poor nail growth, poor tooth enamel, impaired vision at night and increased susceptibility to infections.
bs: Odgovarajući unos vitamina A kroz hranu spriječit će gubitak kose, razne kožne bolesti, suhe oči, loš rast noktiju, lošu caklinu zuba, oslabljen vid noću i povećanu osjetljivost na infekcije.

# vitaminAContent
source: Vitamin A has a number of important roles in the body: • Eye health - Vitamin A is involved in the synthesis of photopigment from the eye, which plays a key role in adapting the eye to light. • Immune function - vitamin A deficiency weakens the immune system, making us more susceptible to various infections. • Supports cell development - Vitamin A is necessary for the proper growth and development of all cells, so adequate intake is extremely important for children and adolescents. • Reproductive function - vitamin A is necessary for the proper development of the embryo in the uterus. Adequate intake of vitamin A through food will prevent symptoms of deficiency of this vitamin, such as hair loss, various skin diseases, dry eyes, poor nail growth, poor tooth enamel, impaired vision at night and increased susceptibility to infections. The needs for vitamin A can be met by an appropriate diet, ie intake of foods rich in this vitamin, such as: • Liver (beef, lamb, goose) • Fatty fish (tuna, salmon, mackerel, trout) and fish oil • Milk and dairy products (primarily fatty cheeses and butter) Eggs • Dark green leafy vegetables (spinach, chard, kale) • Yellow / orange fruits and vegetables (pumpkin, sweet potato, carrot, melon, apricot, peach) • Tomatoes • Enriched foods (dairy products, margarine spreads, cereals)
bs: Vitamin A ima brojne važne uloge u organizmu: •Očuvanje zdravlja očiju – vitamin A sudjeluje u sintezi fotopigmenta iz oka koji ima ključnu ulogu u prilagodbi oka na svjetlost. •Imunološka funkcija – deficit vitamina A oslabljuje imunološki sustav, što nas čini podložnijma različitim infekcijama. •Podržava razvoj stanica – vitamin A neophodan je za pravilan rast i razvoj svih stanica, stoga je adekvatan unos od izrazite važnosti za djecu i adolescente. •Reproduktivna funkcija – vitamin A nužan je za pravilan razvoj embrija u maternici. Adekvatan unos vitamina A putem hrane, spriječiti će simptome nedostatka ovog vitamina, kao što su opadanje kose, različita kožna oboljenja, suhoća očiju, slab rast noktiju, slaba zubna caklina, oslabljen vid noću te povećana osjetljivost na infekcije. Potrebe za vitaminom A moguće je zadovoljiti odgovarajućom prehranom, odnosno unosom namirnica koje su bogate ovim vitaminom kao što su: •Jetra (goveđa, janjeća, gusja) •Masna riba (tuna, losos, skuša, pastrva) i riblje ulje •Mlijeko i mliječni proizvodi (prvenstveno masniji sirevi i maslac) Jaja •Tamnozeleno lisnato povrće (špinat, blitva, kelj) •Voće i povrće žute/narančaste boje (bundeva, batat, mrkva, dinja, marelica, breskva) •Rajčice •Obogaćene namirnice (mliječni proizvodi, margarinski namazi, žitarice)

# vitaminB6ShortDesc
source: Vitamin B6 plays a role in metabolism, the nervous system, and red blood cells. This vitamin is necessary for your body's cells and plays an important role in pregnancy and the proper function of the immune system.
bs: Vitamin B6 igra ulogu u metabolizmu, živčanom sustavu i crvenim krvnim zrncima. Ovaj vitamin neophodan je za stanice našeg tijela i igra važnu ulogu u trudnoći i pravilnoj funkciji imunološkog sustava.

# vitaminB6Content
source: Role: Vitamin B6 plays a role in amino acid metabolism, protein formation, chemical neurotransmitters of the nervous system, red blood cells and prostaglandins. This vitamin is necessary for cell proliferation and as such plays an important role in pregnancy and the proper function of the immune system, mucous membranes, skin, red blood cells and brain function. Deficit: Symptoms of vitamin B6 deficiency include anemia, arthritis, depression, learning disorders, muscle spasm, weakness, and acne. Although vitamin B6 deficiency is rare, it can occur in alcoholics, kidney patients, women taking birth control pills, and immune system disorders. Sources of vitamin B6 in food: Vitamin B6 is found in significant amounts in bananas, wheat yeast, eggs, beef, and green leafy vegetables. Usage: Vitamin B6 supplements are used to treat several diseases and conditions. Autism is thought to be related to a decrease in the number of certain brain neurotransmitters that require vitamin B6 to function normally. Heart disease is associated with low doses of vitamin B6 in the body. Numerous studies have reported that people with low levels of pyridoxal-5-phosphate (a form of vitamin B6) show a much higher risk of heart attack than people with higher levels.
bs: Uloga: Vitamin B6 ima ulogu u metabolizmu aminokiselina, stvaranju proteina, kemijskih neurotransmitera živčanog sustava, crvenih krvnih zrnaca i prostaglanida. Ovaj vitamin je nužan za razmnožvanje stanica te kao takav igra važnu ulogu u trudnoći i pravilnoj funkciji imunosnog sustava, mukozne membrane, kože, crvenih krvnih zrnaca i radu mozga. Deficit: Simptomi deficita vitamina B6 uklučuju anemiju, artritis, depresiju, poremećaje učenja, mišični spazam, slabost, pojavu akni. Iako je deficit vitamina B6 rijedak, može se javiti kod alkoholičara, bubrežnih bolesnika, žena koje uzimaju kontracepcijske tablete te kod poremećaja imunosnog sustava. Izvori vitamina B6 u hrani: Vitamina B6 u znatnim količinama ima u bananama, pšeničnom kvascu, jajima, govedini, zelenom lisntom povrću. Upotreba: Suplementi vitamina B6 koriste se u svrhu liječenja nekoliko bolesti i stanja. Smatra se da je autizam vezan uz smanjenje broja određenih moždanih neurotansmitera koji zahtijevaju vitamin B6 da bi normalno funkcinirali. Srčane bolesti povezane su sa niskim dozama vitamina B6 u organizmu. Brojne studije izvjestile su da osobe sa niskim razinama piridoksal-5-fosfata (oblik vitamina B6) pokazuju mnogo veći rizik od srčanog udara od osoba sa većim raznama.

# vitaminB12ShortDesc
source: Vitamin B12 is naturally present in foods such as fish, meat, poultry, eggs, milk and dairy products. Its key roles are to protect us from anemia and promote healthy nerve function.
bs: Vitamin B12 prirodno je prisutan u hrani poput ribe, mesa, peradi, jaja, mlijeka i mliječnih proizvoda. Njegove su ključne uloge zaštititi nas od anemije i promovirati zdravu funkciju živaca.

# vitaminB12Content
source: Vitamin B12, also called cobalamin, is a water-soluble vitamin that is naturally present in foods such as fish, meat, poultry, eggs, milk and dairy products. Its key role is to protect us from anemia, the main culprit for the feeling of fatigue and exhaustion, ie to provide the body with enough red blood cells that will successfully carry oxygen throughout the body. Vitamin B12 also promotes healthy nerve function, and some research has linked this vitamin to a lower risk of breast cancer, heart disease and infertility (especially men because it increases sperm count and motility). According to the recommendations of the American National Institutes of Health, 2.4 milligrams of vitamin B2 should be taken daily through food or supplements. Vegans are also at risk of vitamin B12 deficiency, as this vitamin is obtained exclusively from foods of animal origin. People with atrophic gastritis may also have a problem with the absorption of this vitamin. However, it should be emphasized that the human body has a large supply of this vitamin, so with insufficient intake through food, the deficit is felt only after a few years. One of the typical symptoms of vitamin B12 deficiency is fatigue. When the supply of vitamin B12 is low, the body cannot produce the red blood cells needed to supply the body with oxygen. The result is anemia, so the person feels unusually weak and weak. The problem is that fatigue as such is a very vague symptom, as it can be attributed to a number of other situations such as stress or lack of sleep. However, if the fatigue is constantly getting worse and you cannot find the cause, be sure to contact your doctor and check your blood count. From your brain, across your spine to your arms and legs, there is a long nervous system called the back tract, which is lined with the fatty white substance myelin. Myelin not only protects and insulates the nerves but also speeds up nerve impulses, allowing the hands and feet to feel the touch. Vitamin B12 is needed to produce myelin. Thus, when the amounts of this essential vitamin are depleted, myelin breaks down and nerve impulses cannot “travel” so fast, resulting in tingling in the arms and legs. People who are at potential risk of deficiency of this vitamin are advised, in addition to consuming foods containing it and supplements, to avoid excessive intake of foods that block the absorption of vitamin B12, such as soy, then drugs that reduce stomach acid, vitamin C, and some data say how the absorption of B 12 is disturbed and diabetes medications. The supply of vitamin B 12 is also depleted by smoking, so smokers (but also everyone else) are recommended to increase the amount of calcium.
bs: Vitamin B12, koji se još naziva kobalamin, vitamin je topiv u vodi koji je prirodno prisutan u namirnicama kao što su riba, meso, perad, jaja, mlijeko i mliječni proizvodi. Njegova je ključna uloga štititi nas od anemije, glavnog krivca za osjećaj umora i malaksalosti, tj. osigurati tijelu dovoljno crvenih krvnih zrnaca koje će uspješno prenositi kisik po cijelom tijelu. Također, vitamin B12 potiče i zdravu funkciju živaca, a neka istraživanja dovode u vezu ovaj vitamin s manjim rizikom od raka dojke, srčanih bolesti te neplodnosti (osobito muškaraca jer povećava broj i pokretljivost spermija). Prema preporukama američkog Nacionalnog instituta za zdravlje dnevno bi trebalo unijeti 2,4 miligrama vitamina B2 kroz hranu ili suplemente. U opasnosti od nedostatka vitamin B12 su i vegani, jer se ovaj vitamin dobiva isključivo iz namirnica životinjskog podrijetla. Problem s apsorpcijom ovog vitamina mogu imati i osobe s atrofičnim gastritisom. Ipak, treba naglasiti kako ljudsko tijelo ima velike zalihe ovog vitamina, pa se pri nedovoljnom unosu putem hrane, deficit osjeti tek nakon nekoliko godina. Jedan od tipičnih simptoma nedostatka vitamina B12 je umor. Kad je zaliha vitamina B12 niska, tijelo ne može proizvesti crvene krvne stanice potrebne za opskrbu tijela kisikom. Rezultat je anemija pa se osoba osjeća neuobičajno slabo i malaksalo. Problem je što je umor kao takav vrlo nejasan simptom, jer ga se može pripisati brojnim drugim situacijama poput stresa ili nedostatka sna. Međutim, ako se umor stalno pogoršava i ne možete mu pronaći uzrok, obvezno se javite liječniku i provjerite krvnu sliku. Od vašeg mozga, preko kralježnice do ruku i nogu postoji dugačak nervni sustav koji se zove stražnji trakt, koji je obložen masnom bijelom tvari mijelinom. Mijelin ne samo da štiti i izolira živce nego i ubrzava živčane impulse, omogućujući da ruke i noge osjete dodir. Vitamin B12 potreban je kako bismo proizveli mijelin. Dakle, kada se isprazne količine ovog esencijalnog vitamina, mijelin se ruši i živčani impulsi ne mogu “putovati” tako brzo, što rezultira trncima u rukama i nogama. Osobama koje su u potencijalnom riziku od deficita ovog vitamina savjetuje se, osim konzumiranja hrane koja ga sadrži i suplemenata, izbjegavati prekomjeran unos namirnica koje blokiraju apsorpciju vitamina B12, poput soje, potom lijekova koji smanjuju želučanu kiselinu, vitamina C, a neki podaci kažu i kako apsorpciju B 12 remete i lijekovi za dijabetes. Zalihe vitamina B 12 iscrpljuje i pušenje pa se pušačima (ali i svima drugima) preporučuje povećati količinu kalcija.

# vitaminCShortDesc
source: Vitamin C is needed to form collagen, plays an important role in wound healing and has an anti-allergic effect. This vitamin also helps defend against viruses and detoxifies the body.
bs: Vitamin C potreban je za stvaranje kolagena, igra važnu ulogu u zacjeljivanju rana i djeluje antialergijski. Ovaj vitamin također pomaže u obrani od virusa i detoksicira tijelo.

# vitaminCContent
source: Vitamin C is needed to form collagen, an 'adhesive' that strengthens many parts of the body such as muscles and blood vessels. Vitamin C plays an important role in wound healing and has an anti-allergic effect. This vitamin stimulates the formation of bile, helps defend against viruses and detoxifies the body. Although vitamin C has little effect in preventing the common cold, it shortens the duration and alleviates the symptoms of the common cold. Foods that are rich in vitamin C are: •broccoli •Red pepper • pomegranate • acerola • citrus •strawberries
bs: Vitamin C je potreban za formiranje kolagena, 'ljepila' koje jača mnoge dijelove tijela poput mišića i krvnih žila. Vitamin C igra važnu ulogu u zacjeljivanju rana i djeluje antialergijski. Ovaj vitamin potiče formiranje žuči, pomaže u obrani od virusa i detoksikaciji organizma. Iako vitamin C ima mali utjecaj u prevenciji obične prehlade, on skraćuje vrijeme trajanja i ublažava simptome prehlade. Namirnice koje su bogate C vitaminom su: •brokula •crvena paprika •šipak •acerola •citrusi •jagode
